from string import Template

### System ####

system_prompt = Template(
    "\n".join(
        [
            "أنت مساعد يقوم بتوليد رد للمستخدم.",
            "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
            "يجب عليك توليد الرد بناءً على المستندات المقدمة فقط.",
            "تجاهل المستندات غير المرتبطة باستعلام المستخدم.",
            "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد مناسب.",
            "يجب أن يكون الرد بنفس لغة استعلام المستخدم.",
            "كن مهذبًا ومحترمًا مع المستخدم.",
            "كن دقيقًا ومختصرًا في ردك، وتجنب المعلومات غير الضرورية.",
        ]
    )
)

#### Document ###
document_prompt = Template(
    "\n".join(["## رقم المستند: $doc_num", "### المحتوى: $chunk_text"])
)

### Footer ###

footer_prompt = Template(
    "\n".join(
        [
            "بناءً فقط على المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
            "## الإجابة:",
        ]
    )
)
